In [2]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import colombia_weather
import prepare

In [165]:
blob = prepare.get_data()

In [167]:
blob.tail()

,region,mean_precip,mean_temp,min_temp,max_temp,price,quantity,inflated
date,,,,,,,,
2018-11-01,Risaralda,0.287551,71.545455,62.0,84.0,140.750333,1300.0,140.750333
2018-11-01,Santander,0.035385,71.872727,63.0,86.0,140.750333,1300.0,140.750333
2018-11-01,Tolima,0.081429,83.381818,58.0,94.0,140.750333,1300.0,140.750333
2018-11-01,Valle,0.246889,84.145455,72.0,92.0,140.750333,1300.0,140.750333
2018-12-01,NaN,NaN,NaN,NaN,NaN,129.622903,1283.0,129.622903

In [ ]:
df = pd.read_csv("psd_coffee.csv")

In [ ]:
df = df[df.Country_Name == "Colombia"]

In [ ]:
df.dtypes

In [ ]:
df[df.Market_Year == 2015]

In [ ]:
import colombia_weather

In [ ]:
pd.DataFrame.from_dict(colombia_weather.stations,orient="index")

In [ ]:
from colombia_weather import weather_stations

In [ ]:
colombia_weather.weather_stations

In [ ]:
colombia_weather.get_weather()

In [ ]:
df = pd.read_csv("coffee_data/coffee.csv")

In [ ]:
df.price_adjusted_inflation.plot()

In [ ]:
df

In [ ]:
df.date = df.date.apply(pd.to_datetime)

In [ ]:
df.set_index('date',inplace=True)

In [ ]:
df.price_adjusted_inflation.plot()
plt.title("Price of coffee 1958-")

In [ ]:
import plotly
import pandas as pd
import plotly.graph_objects as go

In [ ]:
url = "https://raw.githubusercontent.com/plotly/datasets/master/gapminderDataFiveYear.csv"
dataset = pd.read_csv(url)

In [ ]:
years = ["1952", "1962", "1967", "1972", "1977", "1982", "1987", "1992", "1997", "2002","2007"]

In [ ]:
continents = list(dataset['continent'].unique())

In [ ]:
fig_dict = {
    "data": [],
    "layout":{},
    "frames": []
    }

In [ ]:
fig_dict['layout']['xaxis'] = {"range": [30,85],'title':'Life Expactancy'}

In [ ]:
# Libraries
import numpy as np
import matplotlib.pyplot as plt
from matplotlib.sankey import Sankey
 
# basic sankey chart
Sankey(flows=[1, -0.20, -0.15, -0.05, -0.50, -0.10], labels=['Colombia', 'First', 'Second', 'Third', 'Fourth', 'Fifth'], orientations=[0, 1, -1, -1, 0,1]).finish()
plt.title("Sankey diagram with default settings")

In [ ]:
import plotly.graph_objects as go

fig = go.Figure(go.Sankey(
    arrangement = "snap",
    node = {
        "label": ["A", "B", "C", "D", "E", "F"],
        "x": [0.5, 0.1, 0.5, 0.7, 0.3, 0.5],
        "y": [0.7, 0.5, 0.2, 0.4, 0.2, 0.3],
        'pad':10},  # 10 Pixels 
    link = {
        "source": [0, 0, 1, 2, 5, 4, 3, 5],
        "target": [5, 3, 4, 3, 0, 2, 2, 3],
        "value": [1, 2, 1, 1, 1, 1, 1, 2]}))

fig.show()

In [ ]:
import plotly.graph_objects as go
import urllib, json

url = 'https://raw.githubusercontent.com/plotly/plotly.js/master/test/image/mocks/sankey_energy.json'
response = urllib.request.urlopen(url)
data = json.loads(response.read())

fig = go.Figure(data=[go.Sankey(
    valueformat = ".0f",
    valuesuffix = "TWh",
    node = dict(
      pad = 15,
      thickness = 15,
      line = dict(color = "black", width = 0.5),
      label =  data['data'][0]['node']['label'],
      color =  data['data'][0]['node']['color']
    ),
    link = dict(
      source =  data['data'][0]['link']['source'],
      target =  data['data'][0]['link']['target'],
      value =  data['data'][0]['link']['value'],
      label =  data['data'][0]['link']['label']
  ))])

fig.update_layout(
    hovermode = 'x',
    title="Energy forecast for 2050<br>Source: Department of Energy & Climate Change, Tom Counsell via <a href='https://bost.ocks.org/mike/sankey/'>Mike Bostock</a>",
    font=dict(size = 10, color = 'white'),
    plot_bgcolor='black',
    paper_bgcolor='black'
)

fig.show()

In [ ]:
country_code = pd.read_json('coffee_data/country_codes.json')

In [ ]:
country_code.columns = ['country','dest']

In [ ]:
country_code

In [ ]:
coffee_export_by_country = pd.read_csv("coffee_data/coffee_export_numbers.csv")

In [ ]:
coffee_export_by_country.shape

In [ ]:
coffee_export_by_country = pd.merge(coffee_export_by_country,country_code,on="dest",how="outer")

In [ ]:
coffee_export_by_country.to_csv("coffee_data/coffee_export_by_country.csv")

In [ ]:
df = pd.read_csv('coffee_data/coffee_export_by_country.csv')

In [ ]:
df.shape

In [52]:
df = colombia_weather.get_weather()

In [53]:
df[df.PRCP >=0].shape[0]/df.shape[0]

0.6217877265790696

In [54]:
df[df.DATE > '1990-01-01'].head(5)

,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,PRCP,TAVG,TMAX,TMIN
0,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,1990-01-06,NaN,72.0,NaN,NaN
1,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,1990-01-08,NaN,69.0,NaN,NaN
2,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,1990-01-09,NaN,71.0,NaN,NaN
3,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,1990-01-10,0.04,70.0,NaN,64.0
4,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,1990-01-11,0.00,69.0,75.0,64.0

In [55]:
df.DATE = pd.to_datetime(df.DATE)
df["DATE2"] = df.DATE

In [4]:
df.dtypes

STATION              object
NAME                 object
LATITUDE            float64
LONGITUDE           float64
ELEVATION           float64
DATE         datetime64[ns]
PRCP                float64
TAVG                float64
TMAX                float64
TMIN                float64
DATE2        datetime64[ns]
dtype: object

In [5]:
df.set_index('DATE',inplace=True)

In [6]:
stations = df.NAME.unique()

In [7]:
station_activity = pd.DataFrame(df.NAME.unique(),columns=['station_name'])

In [8]:
station_activity.head(2)

    station_name
0  PALONEGRO, CO
1   SAN LUIS, CO

In [9]:
station_activity = station_activity.sort_values(by='station_name').set_index('station_name')

In [10]:
station_activity.head()

Empty DataFrame
Columns: []
Index: [ALFONSO LOPEZ PUMAREJO, CO, ALFREDO VASQUEZ COBO, CO, ALMIRANTE PADILLA, CO, ANTONIO ROLDAN BETANCOURT, CO, BENITO SALAS, CO]

In [11]:
station_activity = pd.concat([station_activity,df.sort_values(by='NAME').groupby("NAME")['DATE2'].min()],axis=1).rename(columns={"DATE2":"first_date_record"})
station_activity = pd.concat([station_activity,df.sort_values(by='NAME').groupby("NAME")['DATE2'].max()],axis=1).rename(columns={"DATE2":"last_date_record"})

In [26]:
station_activity

                              first_date_record last_date_record
NAME
ALFONSO LOPEZ PUMAREJO, CO           1969-08-20       2020-01-07
ALFREDO VASQUEZ COBO, CO             1967-08-23       2020-01-07
ALMIRANTE PADILLA, CO                1973-01-03       2020-01-07
ANTONIO ROLDAN BETANCOURT, CO        1984-12-29       2020-01-07
BENITO SALAS, CO                     1964-09-17       2020-01-07
BOGOTA ELDORADO, CO                  1960-01-12       2020-01-07
CALI ALFONSO BONILL, CO              1961-01-01       2020-01-07
CAMILO DAZA, CO                      1964-09-16       2020-01-07
EL CARANO, CO                        1963-01-21       2020-01-07
EL EDEN, CO                          1964-09-17       2020-01-07
EL EMBRUJO, CO                       1979-04-23       2020-01-07
ERNESTO CORTISSOZ, CO                1960-01-14       2020-01-07
JOSE MARIA CORDOVA, CO               1985-12-01       2020-01-07
LAS GAVIOTAS, CO                     1967-08-01       2002-05-02
LOS GARZONES, CO                     1964-09-17       2020-01-07
MATECANA, CO                         1963-03-22       2020-01-07
OLAYA HERRERA, CO                    1960-01-10       2020-01-07
PALONEGRO, CO                        1975-04-05       2020-01-07
PASTO ANTONIO NARIN, CO              1960-02-01       2020-01-07
PERALES, CO                          1973-01-01       2020-01-07
PUERTO CARRENO A.GU, VE              1968-03-14       2020-01-07
RAFAEL NUNEZ, CO                     1963-11-25       2020-01-07
SAN ANDRES ISLA S, CO                1962-01-01       2020-01-07
SAN LUIS, CO                         1964-09-16       2020-01-07
SANTA ROSA AMANADONA, VE             1969-11-28       1992-01-31
SANTIAGO PEREZ, CO                   1964-09-17       2020-01-07
SIMON BOLIVAR, CO                    1964-09-16       2020-01-07
VANGUARDIA, CO                       1964-09-17       2020-01-07
YARIGUIES, CO                        1964-09-16       2020-01-07

In [ ]:
grouper = df.groupby([pd.Grouper(freq='1M'),'NAME'])

In [ ]:
grouper = grouper.mean().reset_index(level='NAME')

In [ ]:
grouper.groupby([pd.Grouper(freq='Y')])

In [ ]:
year_1960 = grouper[grouper.index < '1961-01-01']

In [ ]:
year_1960.NAME.nunique()

In [ ]:
grouper.groupby([pd.Grouper(freq='Y')])['NAME'].nunique()

In [ ]:
def weather_stations_by_year():
    df = colombia_weather.get_weather()
    df.DATE = pd.to_datetime(df.DATE)
    df.set_index('DATE',inplace=True)
    return df.groupby([pd.Grouper(freq='Y')])['NAME'].nunique()

In [ ]:
df = weather_stations_by_year()

In [12]:
df = prepare.get_data()

In [20]:
weather_stations = pd.DataFrame.from_dict(colombia_weather.weather_stations,orient='index')

In [32]:
weather_stations = weather_stations.sort_index()

In [37]:
station_dates = pd.concat([weather_stations,station_activity],axis=1)

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [45]:
station_dates = station_dates.dropna().rename(columns = {0: "department"})

In [47]:
station_dates.sort_values(by='first_date_record')

                                 department first_date_record last_date_record
BOGOTA ELDORADO, CO            Cundinamarca        1960-01-12       2020-01-07
PASTO ANTONIO NARIN, CO              Narino        1960-02-01       2020-01-07
CALI ALFONSO BONILL, CO               Valle        1961-01-01       2020-01-07
EL CARANO, CO                         Cauca        1963-01-21       2020-01-07
MATECANA, CO                      Risaralda        1963-03-22       2020-01-07
SIMON BOLIVAR, CO                 Magdalena        1964-09-16       2020-01-07
BENITO SALAS, CO                      Huila        1964-09-17       2020-01-07
EL EDEN, CO                         Quindio        1964-09-17       2020-01-07
ALFONSO LOPEZ PUMAREJO, CO            Cesar        1969-08-20       2020-01-07
PERALES, CO                          Tolima        1973-01-01       2020-01-07
PALONEGRO, CO                     Santander        1975-04-05       2020-01-07
ANTONIO ROLDAN BETANCOURT, CO     Antioquia        1984-12-29       2020-01-07
JOSE MARIA CORDOVA, CO               Caldas        1985-12-01       2020-01-07

In [49]:
station_dates.to_csv('weather_data/station_dates.csv')

In [50]:
blob = pd.read_csv('coffee_data/coffee_export_by_country.csv')

      Unnamed: 0    year origin dest  sitc4  export_val  import_val country
3152        3152  2012.0    col  xxb  711.0   4441565.0         NaN     NaN

In [81]:
df = prepare.get_data()

In [82]:
df.head(5)

,region,mean_precip,mean_temp,min_temp,max_temp,price,quantity,inflated
date,,,,,,,,
1960-01-01,Caldas,0.040000,72.500000,NaN,NaN,45.68,782.0,387.519181
1960-01-01,Cundinamarca,0.280000,58.250000,NaN,NaN,45.68,782.0,387.519181
1960-02-01,Caldas,0.040000,72.210526,NaN,NaN,45.95,449.0,389.809684
1960-02-01,Cundinamarca,0.082857,58.894737,NaN,NaN,45.95,449.0,389.809684
1960-02-01,Narino,0.015172,NaN,NaN,NaN,45.95,449.0,389.809684

In [83]:
weather_stations = pd.DataFrame.from_dict(colombia_weather.weather_stations,orient="index")

In [84]:
weather_stations.reset_index(inplace=True)
df.reset_index(inplace=True)

In [85]:
weather_stations

                            index             0
0   ANTONIO ROLDAN BETANCOURT, CO     Antioquia
1          JOSE MARIA CORDOVA, CO        Caldas
2                   EL CARANO, CO         Cauca
3      ALFONSO LOPEZ PUMAREJO, CO         Cesar
4             BOGOTA ELDORADO, CO  Cundinamarca
5                BENITO SALAS, CO         Huila
6               SIMON BOLIVAR, CO     Magdalena
7         PASTO ANTONIO NARIN, CO        Narino
8                     EL EDEN, CO       Quindio
9                    MATECANA, CO     Risaralda
10                  PALONEGRO, CO     Santander
11                    PERALES, CO        Tolima
12        CALI ALFONSO BONILL, CO         Valle

In [86]:
df.shape

(5559, 9)

In [87]:
station_dates = pd.merge(df,weather_stations,how='left',left_on='region',right_on=0)

In [88]:
weather_stations.shape

(13, 2)

In [90]:
station_dates.set_index('date',inplace=True)

In [95]:
station_dates.head(2)

,region,mean_precip,mean_temp,min_temp,max_temp,price,quantity,inflated,index,0
date,,,,,,,,,,
1960-01-01,Caldas,0.04,72.50,NaN,NaN,45.68,782.0,387.519181,"JOSE MARIA CORDOVA, CO",Caldas
1960-01-01,Cundinamarca,0.28,58.25,NaN,NaN,45.68,782.0,387.519181,"BOGOTA ELDORADO, CO",Cundinamarca

In [135]:
station_activity = pd.DataFrame(station_dates.region.unique())

In [136]:
station_activity.dropna(inplace=True)

In [137]:
station_activity.columns = ['region']

In [138]:
station_activity

          region
0         Caldas
1   Cundinamarca
2         Narino
4          Cauca
5      Risaralda
6      Antioquia
7          Huila
8      Magdalena
9        Quindio
10        Tolima
11         Valle
12         Cesar
13     Santander

In [115]:
df.reset_index(inplace=True)
df.head(2)

,index,date,region,mean_precip,mean_temp,min_temp,max_temp,price,quantity,inflated
0,0,1960-01-01,Caldas,0.04,72.50,NaN,NaN,45.68,782.0,387.519181
1,1,1960-01-01,Cundinamarca,0.28,58.25,NaN,NaN,45.68,782.0,387.519181

In [139]:
station_activity = pd.concat([station_activity,df.sort_values(by='region').groupby("region")['date'].min()],axis=1).rename(columns={"date":"first_date_record"})
station_activity = pd.concat([station_activity,df.sort_values(by='region').groupby("region")['date'].max()],axis=1).rename(columns={"date":"last_date_record"})

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [148]:
station_activity = station_activity.iloc[13:].drop(columns='region')

In [150]:
station_activity.to_csv('weather_data/station_dates.csv')

In [151]:
df = prepare.get_weather()

In [155]:
df.set_index('DATE',inplace=True)

In [158]:
df.head(2)

,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,PRCP,TAVG,TMAX,TMIN
DATE,,,,,,,,,
1975-04-05,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,72.0,NaN,64.0
1975-04-10,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,73.0,77.0,66.0

In [157]:
df.groupby(['STATION','')

In [162]:
df.columns.apply(lower)

AttributeError: 'Index' object has no attribute 'apply'

In [163]:
df.columns = map(str.lower, df.columns)

In [164]:
df

,station,name,latitude,longitude,elevation,prcp,tavg,tmax,tmin
DATE,,,,,,,,,
1975-04-05,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,72.0,NaN,64.0
1975-04-10,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,73.0,77.0,66.0
1975-04-13,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,72.0,79.0,64.0
1975-04-15,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,73.0,79.0,66.0
1975-04-30,COM00080094,"PALONEGRO, CO",7.127,-73.185,1187.8,NaN,68.0,73.0,NaN
...,...,...,...,...,...,...,...,...,...
2020-01-03,COM00080091,"YARIGUIES, CO",7.024,-73.807,125.6,0.00,85.0,NaN,75.0
2020-01-04,COM00080091,"YARIGUIES, CO",7.024,-73.807,125.6,0.00,85.0,NaN,75.0
2020-01-05,COM00080091,"YARIGUIES, CO",7.024,-73.807,125.6,0.12,84.0,91.0,75.0
2020-01-06,COM00080091,"YARIGUIES, CO",7.024,-73.807,125.6,0.00,83.0,NaN,74.0
2020-01-07,COM00080091,"YARIGUIES, CO",7.024,-73.807,125.6,0.12,84.0,NaN,74.0

In [3]:
df = prepare.get_data()

In [10]:
df.columns

Index(['region', 'mean_precip', 'mean_temp', 'min_temp', 'max_temp', 'price',
       'quantity', 'inflated'],
      dtype='object')

In [16]:
df[df.inflated.isna()].shape

(142, 8)

In [23]:
df[df.inflated.isna()].head(120)

,region,mean_precip,mean_temp,min_temp,max_temp,price,quantity,inflated
date,,,,,,,,
1964-02-03,Caldas,0.091429,74.806452,48.0,93.0,NaN,NaN,NaN
1964-02-03,Cundinamarca,NaN,55.032258,23.0,77.0,NaN,NaN,NaN
1964-02-03,Narino,NaN,68.375000,50.0,79.0,NaN,NaN,NaN
1964-02-03,Risaralda,0.040000,76.571429,61.0,90.0,NaN,NaN,NaN
1969-02-03,Antioquia,NaN,54.500000,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
2009-02-02,Risaralda,NaN,71.612903,NaN,80.0,NaN,NaN,NaN
2009-02-02,Santander,NaN,70.677419,NaN,NaN,NaN,NaN,NaN
2009-02-02,Tolima,NaN,82.571429,NaN,NaN,NaN,NaN,NaN
2009-02-02,Valle,NaN,81.666667,NaN,NaN,NaN,NaN,NaN
2014-02-03,Antioquia,0.215000,54.647059,38.0,NaN,NaN,NaN,NaN